/* 1. Создать пустой проект в IntelliJ IDEA и прописать метод main();
2. Создать переменные всех пройденных типов данных, и инициализировать их значения; */

package yushkevich.lesson_1.homework;

public class Part1 {
    public static void main(String[] args) {
        String a = "Строка";    //Строковый тип данных
        char b = 'd';           //Символ 16 бит
        byte c = 1;             //Целое число 8 бит
        short d = 2;            //Целое число 16 бит
        int e = 3;              //Целое число 32 бита
        long f = 4;             //Целое число 64 бита
        float g = 5.1f;         //Число с плавающей точкой 32 бита
        double h = 6.0;         //Число с плавающей точкой 64 бита
        boolean i = true;       //Логический тип данных (ложь/истина)
    }
}